/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jleslee <jleslee@student.21-school.ru>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/25 22:19:22 by jleslee           #+#    #+#             */
/*   Updated: 2021/10/26 12:19:11 by jleslee          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//******************Part II******************//

// Применяет функцию f к каждому символу строки, 
// передаваемой в качестве аргумента, и передает 
// её индекс в качестве первого аргумента. 

#include "libft.h"

char	*ft_striteri(char *s, void (*f)(unsigned int, char*))
{
	int	i;

	i = 0;
	if (!s || !f)
		return (NULL);
	while (s[i])
	{
		f(i, s + i);
		i++;
	}
	return (s);
}
